# Chapter 13

In [1]:
import numpy as np 
import pandas as pd

In [8]:
data = pd.DataFrame([0.25, 0.5, 0.75, 1.0])
data

      0
0  0.25
1  0.50
2  0.75
3  1.00

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
data = pd.DataFrame({
    'Fahim': [0.25, 0.5, 0.75, 1.0], 
    'Faisal': [1, 2, 3, 4],},
                 index = ['a', 'b', 'c', 'd'])

In [24]:
data

   Fahim  Faisal
a   0.25       1
b   0.50       2
c   0.75       3
d   1.00       4

In [7]:
data['b']

np.float64(0.5)

**Series as Specialized Dictionary**

In [16]:
population_dict = {
    'California': 3958223,
    'Texas': 29145505,
    'Florida': 2158187,
    'New York': 20201249,
    'Pennsylvania': 13002700}

population= pd.Series(population_dict)

In [17]:
population

California       3958223
Texas           29145505
Florida          2158187
New York        20201249
Pennsylvania    13002700
dtype: int64

In [18]:
population['California']

np.int64(3958223)

In [19]:
area_dict = {
    'California': 423967,
    'Texas': 695662,
    'Florida': 170312, 
    'New York': 141297,
    'Pennsylvania': 119280}

area = area_dict

In [20]:
states = pd.DataFrame({'population': population, 
                       'area': area})
states

              population    area
California       3958223  423967
Texas           29145505  695662
Florida          2158187  170312
New York        20201249  141297
Pennsylvania    13002700  119280

In [21]:
states = pd.DataFrame({
    'Population': [3958223, 29145505, 2158187, 20201249, 13002700],
    'Area': [423967, 695662, 170312, 141297, 119280],}, 
    index = ['California', 'Texas', 'Florida', 'New York', 'Penssylvania'])

In [22]:
states

              Population    Area
California       3958223  423967
Texas           29145505  695662
Florida          2158187  170312
New York        20201249  141297
Penssylvania    13002700  119280

In [23]:
states['Area']

California      423967
Texas           695662
Florida         170312
New York        141297
Penssylvania    119280
Name: Area, dtype: int64

In [24]:
pd.DataFrame(population, columns = ['population'])

              population
California       3958223
Texas           29145505
Florida          2158187
New York        20201249
Pennsylvania    13002700

In [27]:
area = pd.Series({
    'California': 423967, 'Texas': 695662,
 'Florida': 170312, 'New York': 141297,
 'Pennsylvania': 119280})

pop = pd.Series({'California': 39538223, 'Texas': 29145505,
 'Florida': 21538187, 'New York': 20201249,
 'Pennsylvania': 13002700})

In [28]:
data = pd.DataFrame({'area':area, 'pop':pop})

In [29]:
data

                area       pop
California    423967  39538223
Texas         695662  29145505
Florida       170312  21538187
New York      141297  20201249
Pennsylvania  119280  13002700

# Chapter 14 Data Indexing

In [30]:
data['area']

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

In [31]:
data.area

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

In [32]:
data['density'] = data['pop'] / data['area']

In [33]:
data

                area       pop     density
California    423967  39538223   93.257784
Texas         695662  29145505   41.896072
Florida       170312  21538187  126.463121
New York      141297  20201249  142.970120
Pennsylvania  119280  13002700  109.009893

In [34]:
data.loc[:'Florida', :'pop']

              area       pop
California  423967  39538223
Texas       695662  29145505
Florida     170312  21538187

In [35]:
data.loc[data.density>120, ['pop', 'density']]

               pop     density
Florida   21538187  126.463121
New York  20201249  142.970120

In [36]:
data.iloc[0,2] = 90

In [37]:
data

                area       pop     density
California    423967  39538223   90.000000
Texas         695662  29145505   41.896072
Florida       170312  21538187  126.463121
New York      141297  20201249  142.970120
Pennsylvania  119280  13002700  109.009893